zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/include/cy_smif.h
/** Specifies enabled type of SMIF cache. */
typedef enum
{
    CY_SMIF_CACHE_SLOW      = 1U,   /**< The SMIF slow cache (in the clk_slow domain) see TRM for details */
    CY_SMIF_CACHE_FAST      = 2U,   /**< The SMIF fast cache  (in the clk_fast domain) see TRM for details */
    CY_SMIF_CACHE_BOTH      = 3U    /**< The SMIF both caches */
} cy_en_smif_cache_t;

/** Specifies the quad enable requirement case.
 * JEDEC Basic Flash Parameter Table: 15th DWORD
**/
typedef enum
{
    CY_SMIF_SFDP_QER_0   = 0, /**< No QE Bit */
    CY_SMIF_SFDP_QER_1   = 1, /**< Bit 1 of Status Register 2 - Write uses 2 bytes using 01h */
    CY_SMIF_SFDP_QER_2   = 2, /**< Bit 6 of Status Register 1 - Write uses 1 byte */
    CY_SMIF_SFDP_QER_3   = 3, /**< Bit 7 of Status Register 2- Write uses 1 byte */
    CY_SMIF_SFDP_QER_4   = 4, /**< Bit 1 of Status Register 2 - Write uses 1 or 2 bytes */
    CY_SMIF_SFDP_QER_5   = 5, /**< Bit 1 of Status Register 2 - Write status uses 01h */
    CY_SMIF_SFDP_QER_6   = 6, /**< Bit 1 of Status Register 2 - Write uses 1 byte using 31h */
} cy_en_smif_qer_t;

/** Specifies the memory interface frequency range of operation.
**/
typedef enum
{
    CY_SMIF_100MHZ_OPERATION   = 0, /**< 100 MHz default operation */
    CY_SMIF_133MHZ_OPERATION   = 1, /**< 133 MHz operation */
    CY_SMIF_166MHZ_OPERATION   = 2, /**< 166 MHz operation */
    CY_SMIF_200MHZ_OPERATION   = 3, /**< 200 MHz operation */
} cy_en_smif_interface_freq_t;

#if (CY_IP_MXSMIF_VERSION>=2) || defined (CY_DOXYGEN)
/** Specifies the data rate. */
/**
* \note
* This enum is available for CAT1B, CAT1C and CAT1D devices.
**/
typedef enum
{
    CY_SMIF_SDR = 0,    /**< The SMIF Single Data Rate (SDR) */
    CY_SMIF_DDR = 1,    /**< The SMIF Double Data Rate (DDR) */
} cy_en_smif_data_rate_t;

/** Specifies the presence of the field. */
/**
* \note
* This enum is available for CAT1B, CAT1C and CAT1D devices.
**/
typedef enum
{
    CY_SMIF_NOT_PRESENT   = 0,
    CY_SMIF_PRESENT_1BYTE = 1,
    CY_SMIF_PRESENT_2BYTE = 2,
} cy_en_smif_field_presence_t;

/** Specifies the merge transaction timeout in terms of clock cycles. */
/**
* \note
* This enum is available for CAT1B, CAT1C and CAT1D devices.
**/
typedef enum
{
    CY_SMIF_MERGE_TIMEOUT_1_CYCLE      = 0,
    CY_SMIF_MERGE_TIMEOUT_16_CYCLES    = 1,
    CY_SMIF_MERGE_TIMEOUT_256_CYCLES   = 2,
    CY_SMIF_MERGE_TIMEOUT_4096_CYCLES  = 3,
    CY_SMIF_MERGE_TIMEOUT_65536_CYCLES = 4,
} cy_en_smif_merge_timeout_t;

#endif /* (CY_IP_MXSMIF_VERSION>=2) */

#if (CY_IP_MXSMIF_VERSION >= 4) || defined (CY_DOXYGEN)
/** Specifies the  PORT priority for XIP space. */
/**
* \note
* This enum is available for CAT1D and CAT1C (Traveo II) devices.
**/
typedef enum
{
    CY_SMIF_EN_BRIDGE_PRIO_SMIF0_XIP_SPACE = 0, // The master accessing through the SMIF0 XIP space has high priority.
    CY_SMIF_EN_BRIDGE_PRIO_SMIF1_XIP_SPACE = 1, // The master accessing through the SMIF1 XIP space has high priority.
} cy_en_smif_bridge_xip_space_pri_t;

/** Specifies the XIP space. */
/**
* \note
* This enum is available for CAT1D and CAT1C (Traveo II) devices.
**/
typedef enum
{
    CY_SMIF_EN_BRIDGE_SMIF0_XIP_SPACE = 0,
    CY_SMIF_EN_BRIDGE_SMIF1_XIP_SPACE = 1,
} cy_en_smif_bridge_xip_space_t;

/** \} group_smif_enums */

/**
* \addtogroup group_smif_data_structures
* \{
*/

/** Specifies the port priority on bridge interface. */
/**
* \note
* This structure is available for CAT1D and CAT1C (Traveo II) devices.
**/
typedef struct
{
    cy_en_smif_bridge_xip_space_pri_t pri_ahb_smif0;  /**< This specifies the priority for AHB access over SMIF0 */
    cy_en_smif_bridge_xip_space_pri_t pri_ahb_smif1;  /**< This specifies the priority for AHB access over SMIF1 */
    cy_en_smif_bridge_xip_space_pri_t pri_axi_smif0;  /**< This specifies the priority for AXI access over SMIF0 */
    cy_en_smif_bridge_xip_space_pri_t pri_axi_smif1;  /**< This specifies the priority for AXI access over SMIF1 */
} cy_stc_smif_bridge_pri_t;

/** Specifies the remap type. */
/**
* \note
* This enum is available for CAT1D and CAT1C (Traveo II) devices.
**/
typedef enum
{
    CY_SMIF_EN_BRIDGE_REMAP_TYPE_INACTIVE   = 0,
    CY_SMIF_EN_BRIDGE_REMAP_TYPE_TO_SMIF0   = 1,
    CY_SMIF_EN_BRIDGE_REMAP_TYPE_TO_SMIF1   = 2,
    CY_SMIF_EN_BRIDGE_REMAP_TYPE_INTERLEAVE = 3,
} cy_en_smif_bridge_remap_type_t;

/** Specifies the interleave size. */
/**
* \note
* This enum is available for CAT1D and CAT1C (Traveo II) devices.
**/
typedef enum
{
    CY_SMIF_EN_BRIDGE_INTERLEAVE_8BYTE   = 0,
    CY_SMIF_EN_BRIDGE_INTERLEAVE_16BYTE  = 1,
    CY_SMIF_EN_BRIDGE_INTERLEAVE_32BYTE  = 2,
    CY_SMIF_EN_BRIDGE_INTERLEAVE_64BYTE  = 3,
    CY_SMIF_EN_BRIDGE_INTERLEAVE_128BYTE = 4,
} cy_en_smif_bridge_interleave_step_t;

/** Specifies the remap size. */
/**
* \note
* This enum is available for CAT1D and CAT1C (Traveo II) devices.
**/
typedef enum
{
    CY_SMIF_EN_BRIDGE_REMAP_SIZE_1MB   = 0x1FF00000U,
    CY_SMIF_EN_BRIDGE_REMAP_SIZE_2MB   = 0x1FE00000U,
    CY_SMIF_EN_BRIDGE_REMAP_SIZE_4MB   = 0x1FC00000U,
    CY_SMIF_EN_BRIDGE_REMAP_SIZE_8MB   = 0x1F800000U,
    CY_SMIF_EN_BRIDGE_REMAP_SIZE_16MB  = 0x1F000000U,
    CY_SMIF_EN_BRIDGE_REMAP_SIZE_32MB  = 0x1E000000U,
    CY_SMIF_EN_BRIDGE_REMAP_SIZE_64MB  = 0x1C000000U,
    CY_SMIF_EN_BRIDGE_REMAP_SIZE_128MB = 0x18000000U,
    CY_SMIF_EN_BRIDGE_REMAP_SIZE_256MB = 0x10000000U,
    CY_SMIF_EN_BRIDGE_REMAP_SIZE_512MB = 0x00000000U,
} cy_en_smif_bridge_remap_region_size_t;

/** Specifies the remap region information. */
/**
* \note
* This structure is available for CAT1D and CAT1C (Traveo II) devices.
**/
typedef struct
{
    uint32_t                              regionIdx;   /**< This specifies the region index (0..8) */
    cy_en_smif_bridge_remap_region_size_t regionSize;  /**< This specifies the region size */
    uint32_t                              xipAddr;     /**< This specifies XIP address to be remapped */
    uint32_t                              phyAddr;     /**< This specifies target remapped address */
} cy_stc_smif_bridge_remap_t;

