zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/include/cy_smif.h
/** Specifies the interleaved memory region. */
/**
* \note
* This structure is available for CAT1D and CAT1C (Traveo II) devices.
**/
typedef struct
{
    uint32_t                              regionIdx;       /**< This specifies the region index (0..8) */
    cy_en_smif_bridge_remap_region_size_t regionSize;      /**< This specifies the region size */
    uint32_t                              xipAddr;         /**< This specifies XIP address to be remapped */
    uint32_t                              phyAddr0;        /**< This specifies remapped address on PORT0 */
    uint32_t                              phyAddr1;        /**< This specifies remapped address on PORT1 */
} cy_stc_smif_bridge_interleave_remap_t;

/** \} group_smif_data_structures */

/**
* \addtogroup group_smif_enums
* \{
*/

#endif /* CY_IP_MXSMIF_VERSION */

/** Specifies the data line index. */
typedef enum
{
    CY_SMIF_DATA_BIT0_TAP_SEL = 0U, /**< Data line zero. */
    CY_SMIF_DATA_BIT1_TAP_SEL = 1U, /**< Data line one. */
    CY_SMIF_DATA_BIT2_TAP_SEL = 2U, /**< Data line two. */
    CY_SMIF_DATA_BIT3_TAP_SEL = 3U, /**< Data line three. */
    CY_SMIF_DATA_BIT4_TAP_SEL = 4U, /**< Data line four. */
    CY_SMIF_DATA_BIT5_TAP_SEL = 5U, /**< Data line five. */
    CY_SMIF_DATA_BIT6_TAP_SEL = 6U, /**< Data line six. */
    CY_SMIF_DATA_BIT7_TAP_SEL = 7U, /**< Data line seven. */
} cy_en_smif_mem_data_line_t;

/** Specifies the sdr cap style. */
typedef enum
{
    CY_SMIF_RX_CAP_STYLE_SDR_POS       = 0,
    CY_SMIF_RX_CAP_STYLE_SDR_NEG_NORM  = 1,
    CY_SMIF_RX_CAP_STYLE_SDR_NEG_PIPED = 2,
} cy_en_sdr_cap_style_t;

#if (CY_IP_MXSMIF_VERSION >= 6U) || defined (CY_DOXYGEN)
/** Specifies CACHE region attribute. */
typedef enum
{
      CY_SMIF_NON_CACHEABLE_NON_BUFFERABLE = 0x00, /**< Non-Cacheable, Non-Bufferable (reset value)*/
      CY_SMIF_NON_CACHEABLE_BUFFERABLE     = 0x01, /**< Non-Cacheable, Bufferable  */
      CY_SMIF_CACHEABLE_WT_WA              = 0x0E, /**< Cacheable, Write Through, Write Allocate */
      CY_SMIF_CACHEABLE_WT_RA              = 0x16, /**< Cacheable, Write Through, Read Allocate */
      CY_SMIF_CACHEABLE_WT_RWA             = 0x1E, /**< Cacheable, Write Through, Read & Write Allocate */
      CY_SMIF_CACHEABLE_WB_WA              = 0x0F, /**< Cacheable, Write Back, Write Allocate */
      CY_SMIF_CACHEABLE_WB_RA              = 0x17, /**< Cacheable, Write Back, Read Allocate */
      CY_SMIF_CACHEABLE_WB_RWA             = 0x1F, /**< Cacheable, Write Back, Read & Write Allocate */
} cy_en_smif_cache_attribute_t;
#endif

/** \cond INTERNAL */
/*******************************************************************************
* These are legacy macros. They are left here just for backward compatibility.
* Do not use them in new designs.
*******************************************************************************/

#define CY_SMIF_SEND_CMPLT                          CY_SMIF_SEND_COMPLETE
#define CY_SMIF_REC_CMPLT                           CY_SMIF_RX_COMPLETE
#define CY_SMIF_REC_BUSY                            CY_SMIF_RX_BUSY
#define CY_SMIF_SEL_INV_INTERNAL_CLK                CY_SMIF_SEL_INVERTED_INTERNAL_CLK
#define CY_SMIF_SEL_INV_FEEDBACK_CLK                CY_SMIF_SEL_INVERTED_FEEDBACK_CLK
#define cy_en_smif_cache_en_t                       cy_en_smif_cache_t
#define Cy_SMIF_GetTxfrStatus                       Cy_SMIF_GetTransferStatus

/** \endcond */

/** \} group_smif_enums */


/**
* \addtogroup group_smif_data_structures
* \{
*/

/***************************************************************************//**
*
* The SMIF user callback function type called at the end of a transfer.
*
* \param event
* The event which caused a callback call.
*
*******************************************************************************/
typedef void (*cy_smif_event_cb_t)(uint32_t event);


/** The SMIF configuration structure. */
typedef struct
{
    uint32_t mode;              /**<  Specifies the mode of operation \ref cy_en_smif_mode_t. */
    uint32_t deselectDelay;     /**<  Specifies the minimum duration of SPI de-selection between SPI transfers:
                                *   - "0": 1 clock cycle.
                                *   - "1": 2 clock cycles.
                                *   - "2": 3 clock cycles.
                                *   - "3": 4 clock cycles.
                                *   - "4": 5 clock cycles.
                                *   - "5": 6 clock cycles.
                                *   - "6": 7 clock cycles.
                                *   - "7": 8 clock cycles. */
#if (CY_IP_MXSMIF_VERSION <= 3)
    uint32_t rxClockSel;        /**< Specifies the clock source for the receiver 
                                *  clock \ref cy_en_smif_clk_select_t. Used for CAT1A, CAT1B and CAT1C devices. */
#endif
    uint32_t blockEvent;        /**< Specifies what happens when there is a Read
                                * from an empty RX FIFO or a Write to a full
                                * TX FIFO. \ref cy_en_smif_error_event_t. */
    cy_en_smif_delay_tap_t   delayTapEnable;      /**<  Delay tap can be enabled or disabled \ref cy_en_smif_delay_tap_t. */
    cy_en_smif_delay_line_t  delayLineSelect;     /**< set line selection which is input. \ref cy_en_smif_delay_line_t */
#if (CY_IP_MXSMIF_VERSION >=4)
    uint32_t                    inputFrequencyMHz;    /**< Input frequency. Used when internal DLL is enabled for setting the speed mode */
    bool                        enable_internal_dll;  /**< Enables internal DLL. Default value by passes DLL */
    cy_en_smif_dll_divider_t    dll_divider_value;    /**< Divider value for DLL */
    cy_en_cy_smif_mdl_tap_sel_t mdl_tap;              /**< Delay tap for DLL MDL */ 
    cy_en_cy_smif_sdl_tap_sel_t device0_sdl_tap;      /**< Delay tap (pos and neg) for DLL SDL timings on Device[0]. */
    cy_en_cy_smif_sdl_tap_sel_t device1_sdl_tap;      /**< Delay tap (pos and neg) for DLL SDL timings on Device[1]. */
    cy_en_cy_smif_sdl_tap_sel_t device2_sdl_tap;      /**< Delay tap (pos and neg) for DLL SDL timings on Device[2]. */
    cy_en_cy_smif_sdl_tap_sel_t device3_sdl_tap;      /**< Delay tap (pos and neg) for DLL SDL timings on Device[3]. */
    cy_en_smif_capture_mode_t   rx_capture_mode;      /**< RX Capture mode used in CAT1C (TVIIC2D6M) and CAT1D Devices */
    cy_en_smif_tx_sdr_extra_t   tx_sdr_extra;         /**< TX SDR Extra used in CAT1C (TVIIC2D6M) and CAT1D Devices */
#endif
} cy_stc_smif_config_t;

