zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/include/cy_smif.h
/** The SMIF internal context data. The user must not modify it. */
typedef struct
{
    uint8_t const volatile * volatile txBufferAddress;    /**<  The pointer to the data to transfer */
    uint32_t txBufferSize;                          /**<  The size of the data to transmit in bytes */
    /**
    * The transfer counter. The number of the transmitted bytes = txBufferSize - txBufferCounter
    */
    uint32_t volatile txBufferCounter;
    uint8_t volatile * volatile rxBufferAddress;    /**<  The pointer to the variable where the received data is stored */
    uint32_t rxBufferSize;                          /**<  The size of the data to be received in bytes */
    /**
    * The transfer counter. The number of the received bytes = rxBufferSize - rxBufferCounter
    */
    uint32_t volatile rxBufferCounter;
    /**
    * The status of the transfer. The transmitting / receiving is completed / in progress
    */
    cy_en_smif_txfr_status_t volatile transferStatus;
    cy_smif_event_cb_t       volatile txCompleteCb;          /**< The user-defined callback executed at the completion of a transmission */
    cy_smif_event_cb_t       volatile rxCompleteCb;          /**< The user-defined callback executed at the completion of a reception */
    /**
    * The timeout in microseconds for the blocking functions. This timeout value applies to all blocking APIs.
    */
    uint32_t timeout;
    /**
    * The timeout in microseconds for polling memory device on its readiness.
    */
    uint16_t memReadyPollDelay;
#if (CY_IP_MXSMIF_VERSION>=2) || defined (CY_DOXYGEN)
    /**
    * \note
    * This parameter is available for CAT1B, CAT1C and CAT1D devices.
    **/
    cy_en_smif_data_rate_t  preCmdDataRate; /**< preferred command data rate */
    /**
    * \note
    * This parameter is available for CAT1B, CAT1C and CAT1D devices.
    **/
    cy_en_smif_txfr_width_t preCmdWidth; /**< preferred command data rate */
    /**
    * \note
    * This parameter is available for CAT1B, CAT1C and CAT1D devices.
    **/
    cy_en_smif_data_rate_t  preXIPDataRate; /**< preferred XIP data rate */
    /**
    * \note
    * This parameter is available for CAT1B, CAT1C and CAT1D devices for Hyperflash/HyperRAM.
    **/
    uint32_t dummyCycles; /**< preferred dummy cycles per transaction */
    /** Determines if the device is memory-mapped, enables the Autodetect
     * using the SFDP, enables the write capability, or enables the crypto
     * support for this memory slave */
    uint32_t flags;
#endif /* CY_IP_MXSMIF_VERSION */
} cy_stc_smif_context_t;

#if (CY_IP_MXSMIF_VERSION>=5) || defined (CY_DOXYGEN)

 /** Specifies SMIF Crypto Region configuration. */
typedef struct{
    uint32_t key[4];                   /**< Specifies the AES key application for the region. */
    uint32_t iv[4];                    /**< Specifies the Crypto IV for the region */
    uint32_t *region_base_address;     /**< Specifies the base address for the region. */
    uint32_t region_size;              /**< Specifies the size of the memory region. */
}cy_stc_smif_crypto_region_config_t;
#endif

#if (CY_IP_MXSMIF_VERSION>=6) || defined (CY_DOXYGEN)
/** Specifies SMIF cache region configuration. */
typedef struct cy_stc_smif_cache_region
{
    bool                                  enabled;          /**< Enable/Disable CACHE Region.*/
    uint32_t                              start_address;    /**< Start address of CACHE region.*/
    uint32_t                              end_address;      /**< End address of CACHE region.*/
    cy_en_smif_cache_attribute_t          cache_attributes; /**< CACHE Transaction attributes set for this region.*/
} cy_stc_smif_cache_region_t;

/** Specifies SMIF cache configuration. */
typedef struct
{
    bool                        enabled;                 /**< Enable/Disable SMIF Internal CACHE.*/
    bool                        cache_retention_on;      /**< If set, retains CACHE in DeepSleep mode. Not applicable in Deep Sleep OFF or Deep Sleep RAM mode.*/
    cy_stc_smif_cache_region_t  **cache_region;          /**< CACHE region configuration. */
    uint32_t                    cache_region_count;      /**< Number of CACHE regions enabled.  */
} cy_stc_smif_cache_config_t;
#endif
/** \} group_smif_data_structures */


/**
* \addtogroup group_smif_low_level_functions
* \{
*/

cy_en_smif_status_t Cy_SMIF_Init(SMIF_Type *base, cy_stc_smif_config_t const *config,
                                uint32_t timeout,
                                cy_stc_smif_context_t *context);
#if (CY_IP_MXSMIF_VERSION>=4) || defined (CY_DOXYGEN)
cy_en_smif_status_t Cy_SMIF_DllConfig(volatile SMIF_Type *base,
                                    cy_stc_smif_config_t const *config,
                                    cy_stc_smif_context_t *context);
#endif
void Cy_SMIF_DeInit(SMIF_Type *base);
void Cy_SMIF_SetDataSelect(SMIF_Type *base, cy_en_smif_slave_select_t slaveSelect,
                                cy_en_smif_data_select_t dataSelect);
void Cy_SMIF_SetMode(SMIF_Type *base, cy_en_smif_mode_t mode);
cy_en_smif_mode_t Cy_SMIF_GetMode(SMIF_Type const *base);
cy_en_smif_status_t Cy_SMIF_TransmitCommand(SMIF_Type *base,
                                uint8_t cmd,
                                cy_en_smif_txfr_width_t cmdTxfrWidth,
                                uint8_t const cmdParam[], uint32_t paramSize,
                                cy_en_smif_txfr_width_t paramTxfrWidth,
                                cy_en_smif_slave_select_t slaveSelect, uint32_t completeTxfr,
                                cy_stc_smif_context_t const *context);
cy_en_smif_status_t Cy_SMIF_TransmitData(SMIF_Type *base,
                                uint8_t const *txBuffer, uint32_t size,
                                cy_en_smif_txfr_width_t transferWidth,
                                cy_smif_event_cb_t TxCompleteCb,
                                cy_stc_smif_context_t *context);
cy_en_smif_status_t  Cy_SMIF_TransmitDataBlocking(SMIF_Type *base,
                                uint8_t const *txBuffer,
                                uint32_t size,
                                cy_en_smif_txfr_width_t transferWidth,
                                cy_stc_smif_context_t const *context);
cy_en_smif_status_t Cy_SMIF_ReceiveData(SMIF_Type *base,
                                uint8_t *rxBuffer, uint32_t size,
                                cy_en_smif_txfr_width_t transferWidth,
                                cy_smif_event_cb_t RxCompleteCb,
                                cy_stc_smif_context_t *context);
cy_en_smif_status_t  Cy_SMIF_ReceiveDataBlocking(SMIF_Type *base,
                                uint8_t *rxBuffer,
                                uint32_t size,
                                cy_en_smif_txfr_width_t transferWidth,
                                cy_stc_smif_context_t const *context);
cy_en_smif_status_t Cy_SMIF_SendDummyCycles(SMIF_Type *base, uint32_t cycles);
cy_en_smif_txfr_status_t Cy_SMIF_GetTransferStatus(SMIF_Type const *base, cy_stc_smif_context_t const *context);
void Cy_SMIF_Enable(SMIF_Type *base, cy_stc_smif_context_t *context);

#if (CY_IP_MXSMIF_VERSION>=2) || defined (CY_DOXYGEN)
cy_en_smif_status_t Cy_SMIF_TransmitCommand_Ext(SMIF_Type *base,
                                                 uint16_t cmd,
                                                 bool isCommand2byte,
                                                 cy_en_smif_txfr_width_t cmdTxfrWidth,
                                                 cy_en_smif_data_rate_t cmdDataRate,
                                                 uint8_t const cmdParam[],
                                                 uint32_t paramSize,
                                                 cy_en_smif_txfr_width_t paramTxfrWidth,
                                                 cy_en_smif_data_rate_t paramDataRate,
                                                 cy_en_smif_slave_select_t slaveSelect,
                                                 uint32_t completeTxfr,
                                                 cy_stc_smif_context_t const *context);

cy_en_smif_status_t Cy_SMIF_TransmitData_Ext(SMIF_Type *base,
                                                uint8_t const *txBuffer,
                                                uint32_t size,
                                                cy_en_smif_txfr_width_t transferWidth,
                                                cy_en_smif_data_rate_t dataDataRate,
                                                cy_smif_event_cb_t TxCmpltCb,
                                                cy_stc_smif_context_t *context);

